ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/DMA0_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="DMA0" HW_revision="1.0">
    <register id="DMA0_FSUB_0" width="32" offset="0x400" description="Subscriber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-255 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <register id="DMA0_FSUB_1" width="32" offset="0x404" description="Subscriber Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-255 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <register id="DMA0_FPUB_1" width="32" offset="0x444" description="Publisher Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-255 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <register id="DMA0_CPU_CONNECT_0" width="32" offset="0x480" description="CPU Connect">
        <bitfield id="NWPW_CONN" description="NWPW connect bit." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="UNCONNECTED" value="0x0" description="The NWPW is not connected."/>
            <bitenum id="CONNECTED" value="0x1" description="The NWPW is connected."/>
        </bitfield>
        <bitfield id="CPUSS0_CONN" description="CPUSS0 connect bit." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="UNCONNECTED" value="0x0" description="The CPU is not connected."/>
            <bitenum id="CONNECTED" value="0x1" description="The CPU is connected."/>
        </bitfield>
    </register>
    <register id="DMA0_PDBGCTL" width="32" offset="0x1018" description="Peripheral Debug Control">
        <bitfield id="FREE" description="Free run control" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STOP" value="0x0" description="The peripheral freezes functionality while the Core Halted input is asserted and resumes when it is deasserted."/>
            <bitenum id="RUN" value="0x1" description="The peripheral ignores the state of the Core Halted input"/>
        </bitfield>
        <bitfield id="SOFT" description="Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="IMMEDIATE" value="0x0" description="The peripheral will halt immediately, even if the resultant state will result in corruption if the system is restarted"/>
            <bitenum id="DELAYED" value="0x1" description="The peripheral blocks the debug freeze until it has reached a boundary where it can resume without corruption"/>
        </bitfield>
    </register>
    <group id="DMA0_CPU_INT" name="DMA0_CPU_INT" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="DMA0_CPU_INT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="DMACH0" value="0x1" description="DMA Channel 0 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH1" value="0x2" description="DMA Channel 1 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH2" value="0x3" description="DMA Channel 2 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH3" value="0x4" description="DMA Channel 3 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH4" value="0x5" description="DMA Channel 4 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH5" value="0x6" description="DMA Channel 5 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH6" value="0x7" description="DMA Channel 6 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH7" value="0x8" description="DMA Channel 7 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH8" value="0x9" description="DMA Channel 8 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH9" value="0xA" description="DMA Channel 9 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH10" value="0xB" description="DMA Channel 10 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH11" value="0xC" description="DMA Channel 11 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH12" value="0xD" description="DMA Channel 12 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH13" value="0xE" description="DMA Channel 13 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH14" value="0xF" description="DMA Channel 14 size counter reached zero (DMASZ=0)."/>
                <bitenum id="DMACH15" value="0x10" description="DMA Channel 15 size counter reached zero (DMASZ=0)."/>
                <bitenum id="PREIRQCH0" value="0x11" description="PRE-IRQ event for DMA Channel 0."/>
                <bitenum id="PREIRQCH1" value="0x12" description="PRE-IRQ event for DMA Channel 1."/>
                <bitenum id="PREIRQCH2" value="0x13" description="PRE-IRQ event for DMA Channel 2."/>
                <bitenum id="PREIRQCH3" value="0x14" description="PRE-IRQ event for DMA Channel 3."/>
                <bitenum id="PREIRQCH4" value="0x15" description="PRE-IRQ event for DMA Channel 4."/>
                <bitenum id="PREIRQCH5" value="0x16" description="PRE-IRQ event for DMA Channel 5."/>
                <bitenum id="PREIRQCH6" value="0x17" description="PRE-IRQ event for DMA Channel 6."/>
                <bitenum id="PREIRQCH7" value="0x18" description="PRE-IRQ event for DMA Channel 7."/>
                <bitenum id="ADDRERR" value="0x19" description="DMA address error, SRC address not reachable."/>
                <bitenum id="DATAERR" value="0x1A" description="DMA data error, SRC data might be corrupted (PAR or ECC error)."/>
            </bitfield>
        </register>
