ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/DMA0_1.0.xml
        </group>
    <group id="DMA0_DMACHAN" name="DMA0_DMACHAN" instances="4" offset="0x1200" instaddr="0x10" description="">
        <register id="DMA0_DMACTL" width="32" offset="0x0" description="DMA Channel Control">
            <bitfield id="DMAREQ" description="DMA request. Software-controlled DMA start. DMAREQ is reset automatically." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="IDLE" value="0x0" description="Default read value"/>
                <bitenum id="REQUEST" value="0x1" description="DMA transfer request (start DMA)"/>
            </bitfield>
            <bitfield id="DMAEN" description="DMA enable" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="DMA channel disabled"/>
                <bitenum id="ENABLE" value="0x1" description="DMA channel enabled"/>
            </bitfield>
            <bitfield id="DMASRCWDTH" description="DMA source width. This bit selects the source data width as a byte, half word, word, long word or long-long word." begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="BYTE" value="0x0" description="Source data width is BYTE (8-bit)"/>
                <bitenum id="HALF" value="0x1" description="Source data width is HALF-WORD (16-bit)"/>
                <bitenum id="WORD" value="0x2" description="Source data width is WORD (32-bit)"/>
                <bitenum id="LONG" value="0x3" description="Source data width is LONG-WORD (64-bit)"/>
                <bitenum id="LONGLONG" value="0x4" description="Source data width is LONG-LONG-WORD (128-bit)"/>
            </bitfield>
            <bitfield id="DMADSTWDTH" description="DMA destination width. This bit selects the destination as a byte, half word, word, long word or long-long word." begin="14" end="12" width="3" rwaccess="R/W">
                <bitenum id="BYTE" value="0x0" description="Destination data width is BYTE (8-bit)"/>
                <bitenum id="HALF" value="0x1" description="Destination data width is HALF-WORD (16-bit)"/>
                <bitenum id="WORD" value="0x2" description="Destination data width is WORD (32-bit)"/>
                <bitenum id="LONG" value="0x3" description="Destination data width is LONG-WORD (64-bit)"/>
                <bitenum id="LONGLONG" value="0x4" description="Source data width is LONG-LONG-WORD (128-bit)"/>
            </bitfield>
            <bitfield id="DMASRCINCR" description="DMA source increment. This bit selects automatic incrementing or decrementing of the source address DMASA for each transfer. The amount of change to the DMASA is based on the definitin in the DMASRCWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMASA by 4." begin="19" end="16" width="4" rwaccess="R/W">
                <bitenum id="UNCHANGED" value="0x0" description="Address is unchanged (+0)"/>
                <bitenum id="DECREMENT" value="0x2" description="Decremented by 1 (-1 * DMASRCWDTH)"/>
                <bitenum id="INCREMENT" value="0x3" description="Incremented by 1 (+1 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_2" value="0x8" description="Stride size 2 (+2 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_3" value="0x9" description="Stride size 3 (+3 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_4" value="0xA" description="Stride size 4 (+4 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_5" value="0xB" description="Stride size 5 (+5 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_6" value="0xC" description="Stride size 6 (+6 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_7" value="0xD" description="Stride size 7 (+7 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_8" value="0xE" description="Stride size 8 (+8 * DMASRCWDTH)"/>
                <bitenum id="STRIDE_9" value="0xF" description="Stride size 9 (+9 * DMASRCWDTH)"/>
            </bitfield>
            <bitfield id="DMADSTINCR" description="DMA destination increment. This bit selects automatic incrementing or decrementing of the destination address DMADA for each transfer. The amount of change to the DMADA is based on the definitin in the DMADSTWDTH. For example an increment of 1 (+1) on a WORD transfer will increment the DMADA by 4." begin="23" end="20" width="4" rwaccess="R/W">
                <bitenum id="UNCHANGED" value="0x0" description="Address is unchanged (+0)"/>
                <bitenum id="DECREMENT" value="0x2" description="Decremented by 1 (-1 * DMADSTWDTH)"/>
                <bitenum id="INCREMENT" value="0x3" description="Incremented by 1 (+1 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_2" value="0x8" description="Stride size 2 (+2 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_3" value="0x9" description="Stride size 3 (+3 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_4" value="0xA" description="Stride size 4 (+4 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_5" value="0xB" description="Stride size 5 (+5 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_6" value="0xC" description="Stride size 6 (+6 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_7" value="0xD" description="Stride size 7 (+7 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_8" value="0xE" description="Stride size 8 (+8 * DMADSTWDTH)"/>
                <bitenum id="STRIDE_9" value="0xF" description="Stride size 9 (+9 * DMADSTWDTH)"/>
            </bitfield>
            <bitfield id="DMATM" description="DMA transfer mode register

Note: The repeat-single (2h) and repeat-block (3h) transfer are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration only the values for single (0h) and block (1h) transfer can be set." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="SINGLE" value="0x0" description="Single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated and the DMAEN is cleared."/>
                <bitenum id="BLOCK" value="0x1" description="Block transfer. Each trigger transfers the complete block defined in DMASZ. After the transfer is complete an event can be generated and the DMAEN is cleared."/>
                <bitenum id="RPTSNGL" value="0x2" description="Repeated single transfer. Each transfers requires a new trigger. When the DMASZ counts down to zero an event can be generated. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled."/>
                <bitenum id="RPTBLCK" value="0x3" description="Repeated block transfer. Each trigger transfers the complete block defined in DMASZ. After the last transfer the DMASA, DMADA, DAMSZ registers are restored to its initial value and the DMAEN stays enabled."/>
            </bitfield>
            <bitfield id="DMAEM" description="DMA extended mode

Note: The extended transfer modes are only available in a FULL-channel configuration. Please consult the datasheet of the specific device to map which channel number has FULL or BASIC capability. In a BASIC channel configuration this register is a read-only register and reads 0x0." begin="25" end="24" width="2" rwaccess="R/W">
                <bitenum id="NORMAL" value="0x0" description="Normal mode is related to transfers from SRC to DST"/>
                <bitenum id="GATHERMODE" value="0x1" description="Gather mode will read a data from an address table located at SA, and the data is transfered to the DA"/>
                <bitenum id="FILLMODE" value="0x2" description="Fill mode will copy the SA register content as data to DA"/>
                <bitenum id="TABLEMODE" value="0x3" description="Table mode will read an address and data value from SA and write the data to address"/>
            </bitfield>
            <bitfield id="DMAPREIRQ" description="Enable an early IRQ event. This can help software to react quicker to and DMA done event or allows some additional configuration before the channel is complete. 

